Revit 2027 API
BuiltInFailures.RebarSystemFailures.AreaReinforcementOutSideOfHost Property
 Area Reinforcement is sketched completely outside of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AreaReinforcementOutSideOfHost { get; }
Public Shared ReadOnly Property AreaReinforcementOutSideOfHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AreaReinforcementOutSideOfHost {
	FailureDefinitionId^ get ();
}
static member AreaReinforcementOutSideOfHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace